InformationRegisters/ПодписанныеДанные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПодписанныеДанные</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СоставПодписи</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодписанныеДанные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДанныеАктуальны</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПроверкиДанных</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодписанныеДанныеФайл</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодписанныеДанныеПОД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ЗадачаПоОбработкеДокумента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкаПравНазначенияИсполнителей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкаПравНазначенияИсполнителей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГруппаИсполнителейЗадачНазначающий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыИсполнителейЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>НазначающийИсполнителей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РольИсполнителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновнойОбъектАдресацииИсполнителя</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ОбъектыАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновнойОбъектАдресацииНазначающего</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ОбъектыАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДополнительныйОбъектАдресацииИсполнителя</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ОбъектыАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДополнительныйОбъектАдресацииНазначающего</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ОбъектыАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИсторияИзмененияСтатусовДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИсторияИзмененияСтатусовДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УстарелДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПредметПроцессаОбработкиДокументов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Установил</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ЗадачаПоОбработкеДокумента</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/УдалитьИсторияСтатусовДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>УдалитьИсторияСтатусовДокументов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Установил</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ЗадачаПоОбработкеДокумента</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПредметПроцессаОбработкиДокументов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТекущиеСтатусыДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ТекущиеСтатусыДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныПроцессов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Установил</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ЗадачаПоОбработкеДокумента</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПредметПроцессаОбработкиДокументов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкаПередачиПравИсполнителей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкаПередачиПравИсполнителей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Кому</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтКого</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РольИсполнителей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновнойОбъектАдресации</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ОбъектыАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДополнительныйОбъектАдресации</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ОбъектыАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ЭтапыПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ЭтапыПроцессов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПоддержки</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РезультатыВыполнения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПредставлениеРезультата</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусПослеВыполнения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатусыДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтрицательныйРезультат</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуетсяЭП</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуетсяПростаяЭП</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скрытый</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ОбновлениеИнформационнойБазыПОД/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ОбновлениеВерсииИБ

////////////////////////////////////////////////////////////////////////////////
// Сведения о библиотеке (или конфигурации).

// Заполняет основные сведения о библиотеке или основной конфигурации.
// Библиотека, имя которой имя совпадает с именем конфигурации в метаданных, определяется как основная конфигурация.
// 
// Параметры:
//  Описание - Структура - сведения о библиотеке:
//
//   * Имя                 - Строка - имя библиотеки, например, "СтандартныеПодсистемы".
//   * Версия              - Строка - версия в формате из 4-х цифр, например, "2.1.3.1".
//
//   * ТребуемыеПодсистемы - Массив - имена других библиотек (Строка), от которых зависит данная библиотека.
//                                    Обработчики обновления таких библиотек должны быть вызваны ранее
//                                    обработчиков обновления данной библиотеки.
//                                    При циклических зависимостях или, напротив, отсутствии каких-либо зависимостей,
//                                    порядок вызова обработчиков обновления определяется порядком добавления модулей
//                                    в процедуре ПриДобавленииПодсистем общего модуля
//                                    ПодсистемыКонфигурацииПереопределяемый.
//   * РежимВыполненияОтложенныхОбработчиков - Строка - "Последовательно" - отложенные обработчики обновления выполняются
//                                    последовательно в интервале от номера версии информационной базы до номера
//                                    версии конфигурации включительно или "Параллельно" - отложенный обработчик после
//                                    обработки первой порции данных передает управление следующему обработчику, а после
//                                    выполнения последнего обработчика цикл повторяется заново.
//
Процедура ПриДобавленииПодсистемы(Описание) Экспорт
	
	Описание.Имя 	= "ПроцессыОбработкиДокументов";
	Описание.Версия = "1.0.18.5";
	
	Описание.РежимВыполненияОтложенныхОбработчиков = "Параллельно";
	Описание.ПараллельноеОтложенноеОбновлениеСВерсии = "1.0.1.8";
	
	Описание.ТребуемыеПодсистемы.Добавить("СтандартныеПодсистемы");
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики обновления информационной базы.

// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// Вызывается перед началом обновления данных ИБ для построения плана обновления.
//
// Параметры:
//  Обработчики - ТаблицаЗначений - см. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления.
//
// Пример:
//  Для добавления своей процедуры-обработчика в список:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.Версия              = "1.1.0.0";
//  Обработчик.Процедура           = "ОбновлениеИБ.ПерейтиНаВерсию_1_1_0_0";
//  Обработчик.РежимВыполнения     = "Оперативно";
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Обработчик 				= Обработчики.Добавить();
	Обработчик.Версия 		= "1.0.2.3";
	Обработчик.Процедура 	= "ОбновлениеИнформационнойБазыПОД.КорректировкаДоступностиШаблонов";
	Обработчик.Опциональный = Истина;
	
	Обработчик 				= Обработчики.Добавить();
	Обработчик.Версия 		= "1.0.2.3";
	Обработчик.Процедура 	= "ОбновлениеИнформационнойБазыПОД.ЗаполнениеРеквизитаКомментарийВЭтапах";
	Обработчик.Опциональный = Истина;
	
	Обработчик 				= Обработчики.Добавить();
	Обработчик.Версия 		= "1.0.3.1";
	Обработчик.Процедура 	= "ОбновлениеИнформационнойБазыПОД.ЗаполнитьПорядокЭтаповШаблонов";
	Обработчик.Опциональный = Истина;
	
	Обработчик 				= Обработчики.Добавить();
	Обработчик.Версия 		= "1.0.4.6";
	Обработчик.Процедура 	= "ОбновлениеИнформационнойБазыПОД.ЗаполнитьТребованияКПроведению";
	Обработчик.Опциональный = Истина;
	
	Обработчик 				= Обработчики.Добавить();
	Обработчик.Версия 		= "1.0.4.8";
	Обработчик.Процедура 	= "ОбновлениеИнформационнойБазыПОД.ПереносПодписанныхДанныхИзЗадачиВРегистрСведений";
	Обработчик.Опциональный = Истина;
	
	Обработчик 				= Обработчики.Добавить();
	Обработчик.Версия 		= "1.0.5.4";
	Обработчик.Процедура 	= "ОбновлениеИнформационнойБазыПОД.ЗаполнитьРеквизитЗапретитьПерепроведение";
	Обработчик.Опциональный = Истина;
	
	Обработчик 				= Обработчики.Добавить();
	Обработчик.Версия 		= "1.0.6.2";
	Обработчик.Процедура 	= "ОбновлениеИнформационнойБазыПОД.ЗаполнитьГруппуИсполнителейЗадачНазначающих";
	Обработчик.Опциональный = Истина;
	
	Обработчик 				= Обработчики.Добавить();
	Обработчик.Версия 		= "1.0.6.2";
	Обработчик.Процедура 	= "ОбновлениеИнформационнойБазыПОД.ЗаполнитьПорядокЭтаповШаблонов";
	Обработчик.Опциональный = Истина;
	
	Обработчик 				= Обработчики.Добавить();
	Обработчик.Версия 		= "1.0.7.3";
	Обработчик.Процедура 	= "ОбновлениеИнформационнойБазыПОД.ПереносИсторииСтатусовДокументов";
	Обработчик.Опциональный = Истина;
	
	Обработчик 				= Обработчики.Добавить();
	Обработчик.Версия 		= "1.0.8.3";
	Обработчик.Процедура 	= "ОбновлениеИнформационнойБазыПОД.КорректировкаРегистраТекущиеСтатусыДокументов";
	
	Обработчик 				= Обработчики.Добавить();
	Обработчик.Версия 		= "1.0.8.5";
	Обработчик.Процедура 	= "ОбновлениеИнформационнойБазыПОД.ПереносДатыУстановкиВИзмерениеРегистраИсторииСтатусов";
	
	Обработчик 				= Обработчики.Добавить();
	Обработчик.Версия 		= "1.0.12.2";
	Обработчик.Процедура 	= "ОбновлениеИнформационнойБазыПОД.ОбновитьТипыДополнительныхКолонок";
	
	Обработчик 				= Обработчики.Добавить();
	Обработчик.Версия 		= "1.0.13.4";
	Обработчик.Процедура 	= "ОбновлениеИнформационнойБазыПОД.ЗаполнитьТипПредметаВНевыполненныхЗадачах";
	
	Обработчик 				= Обработчики.Добавить();
	Обработчик.Версия 		= "1.0.13.7";
	Обработчик.Процедура 	= "ОбновлениеИнформационнойБазыПОД.УстановитьКонстантуОтображенияДатыПодписанияВШтампеПЭП";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.13.4";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "Задачи.ЗадачаПоОбработкеДокумента.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("497cb9df-d399-42d3-9e75-b5e030b5602a");
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "Задачи.ЗадачаПоОбработкеДокумента.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.ЧитаемыеОбъекты = "Задача.ЗадачаПоОбработкеДокумента";
	Обработчик.ИзменяемыеОбъекты = "Задача.ЗадачаПоОбработкеДокумента";
	Обработчик.БлокируемыеОбъекты = "Задача.ЗадачаПоОбработкеДокумента";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение реквизита ""Тип предмета"" в выполненных задачах по обоработке документов'");   
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.15.7";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПОД.ОбработатьДанныеРегистрНаличиеФайлов";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("bc3f010f-f147-4405-9427-a77bec216425");
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "ОбновлениеИнформационнойБазыПОД.ЗарегистрироватьДанныеКОбработкеРегистрНаличиеФайлов";
	Обработчик.ПроцедураПроверки = "";
	Обработчик.БлокируемыеОбъекты = "";
	Обработчик.ЧитаемыеОбъекты = "РегистрСведений.НаличиеФайлов";
	Обработчик.ИзменяемыеОбъекты = "РегистрСведений.НаличиеФайлов";
	Обработчик.Комментарий = НСтр("ru = 'Исправляет признак наличия прикрепленных к объекту файлов.'");
	
	ПроцессыОбработкиДокументовПереопределяемый.ПриДобавленииОбработчиковОбновления(Обработчики);
	
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыПереопределяемый.ПередОбновлениемИнформационнойБазы.
Процедура ПередОбновлениемИнформационнойБазы() Экспорт
	
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыПереопределяемый.ПослеОбновленияИнформационнойБазы.
Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсия, Знач ТекущаяВерсия,
		Знач ВыполненныеОбработчики, ВыводитьОписаниеОбновлений, МонопольныйРежим) Экспорт
		
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыПереопределяемый.ПриПодготовкеМакетаОписанияОбновлений.
Процедура ПриПодготовкеМакетаОписанияОбновлений(Знач Макет) Экспорт
	
КонецПроцедуры

// Позволяет переопределить режим обновления данных информационной базы.
// Для использования в редких (нештатных) случаях перехода, не предусмотренных в
// стандартной процедуре определения режима обновления.
//
// Параметры:
//   РежимОбновленияДанных - Строка - в обработчике можно присвоить одно из значений:
//              "НачальноеЗаполнение"     - если это первый запуск пустой базы (области данных);
//              "ОбновлениеВерсии"        - если выполняется первый запуск после обновление конфигурации базы данных;
//              "ПереходСДругойПрограммы" - если выполняется первый запуск после обновление конфигурации базы данных, 
//                                          в которой изменилось имя основной конфигурации.
//
//   СтандартнаяОбработка  - Булево - если присвоить Ложь, то стандартная процедура
//                                    определения режима обновления не выполняется, 
//                                    а используется значение РежимОбновленияДанных.
//
Процедура ПриОпределенииРежимаОбновленияДанных(РежимОбновленияДанных, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Добавляет в список процедуры-обработчики перехода с другой программы (с другим именем конфигурации).
// Например, для перехода между разными, но родственными конфигурациями: базовая -> проф -> корп.
// Вызывается перед началом обновления данных ИБ.
//
// Параметры:
//  Обработчики - ТаблицаЗначений - с колонками:
//    * ПредыдущееИмяКонфигурации - Строка - имя конфигурации, с которой выполняется переход;
//                                           или "*", если нужно выполнять при переходе с любой конфигурации.
//    * Процедура                 - Строка - полное имя процедуры-обработчика перехода с программы
//                                           ПредыдущееИмяКонфигурации.
//                                  Например, "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику"
//                                  Обязательно должна быть экспортной.
//
// Пример:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.ПредыдущееИмяКонфигурации  = "УправлениеТорговлей";
//  Обработчик.Процедура                  = "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику";
//
Процедура ПриДобавленииОбработчиковПереходаСДругойПрограммы(Обработчики) Экспорт
	
КонецПроцедуры

// Вызывается после выполнения всех процедур-обработчиков перехода с другой программы (с другим именем конфигурации),
// и до начала выполнения обновления данных ИБ.
//
// Параметры:
//  ПредыдущееИмяКонфигурации    - Строка - имя конфигурации до перехода.
//  ПредыдущаяВерсияКонфигурации - Строка - имя предыдущей конфигурации (до перехода).
//  Параметры                    - Структура - 
//    * ВыполнитьОбновлениеСВерсии   - Булево - по умолчанию Истина. Если установить Ложь, 
//        то будут выполнена только обязательные обработчики обновления (с версией "*").
//    * ВерсияКонфигурации           - Строка - номер версии после перехода. 
//        По умолчанию, равен значению версии конфигурации в свойствах метаданных.
//        Для того чтобы выполнить, например, все обработчики обновления с версии ПредыдущаяВерсияКонфигурации, 
//        следует установить значение параметра в ПредыдущаяВерсияКонфигурации.
//        Для того чтобы выполнить вообще все обработчики обновления, установить значение "0.0.0.1".
//    * ОчиститьСведенияОПредыдущейКонфигурации - Булево - по умолчанию Истина. 
//        Для случаев когда предыдущая конфигурация совпадает по имени с подсистемой текущей конфигурации, следует
//        указать Ложь.
//
Процедура ПриЗавершенииПереходаСДругойПрограммы(ПредыдущееИмяКонфигурации, ПредыдущаяВерсияКонфигурации, Параметры) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ОбновлениеВерсииИБ

Процедура ЗарегистрироватьОбработчикиОбновленияДляСоставногоТипаВОбъектахАдресацииЗадач(Обработчики, Версия) Экспорт
	
	Если ПланыВидовХарактеристик.ОбъектыАдресацииЗадач.ПустаяСсылка().Метаданные().Тип.Типы().Количество() < 2 Тогда
		Возврат;
	КонецЕсли;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = Версия;
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПОД.ОбновитьИсполнителейЗадач";
	Обработчик.РежимВыполнения = "Монопольно";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = Версия;
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПОД.ОбновитьШаблоныПроцессов";
	Обработчик.РежимВыполнения = "Монопольно";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = Версия;
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПОД.ОбновитьРегламентныеИнтервалы";
	Обработчик.РежимВыполнения = "Монопольно";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = Версия;
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПОД.ОбновитьНастройкиПравНазначенияИсполнителей";
	Обработчик.РежимВыполнения = "Монопольно";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = Версия;
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПОД.ОбновитьНастройкиПередачиПравИсполнителей";
	Обработчик.РежимВыполнения = "Монопольно";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = Версия;
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПОД.ОбновитьАктивныеЗадачиПоОбработкеДокументов";
	Обработчик.РежимВыполнения = "Монопольно";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = Версия;
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыПОД.ОбновитьВыполненныеЗадачиПоОбработкеДокументов";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("43871e96-ece7-48e8-a5ed-bd3b435a615d");
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "ОбновлениеИнформационнойБазыПОД.ЗарегистрироватьВыполненныеЗадачиДанныеКОбработке";
	Обработчик.ОчередьОтложеннойОбработки = 1;
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.ЧитаемыеОбъекты = "Задачи.ЗадачаПоОбработкеДокумента";
	Обработчик.ИзменяемыеОбъекты = "Задачи.ЗадачаПоОбработкеДокумента";
	Обработчик.БлокируемыеОбъекты = "Задачи.ЗадачаПоОбработкеДокумента";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение пустых объектов адресации значением Неопределено для задач ""Задача по обработке документа""'");
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбновления

Процедура КорректировкаДоступностиШаблонов() Экспорт
	
	Выборка = Справочники.ШаблоныПроцессов.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Объект = Выборка.ПолучитьОбъект();
		
		// проверка на наличие доступных реквизитов на более поздних этапах, чем была установлена ответственность
		ОшибочноДоступныеРеквизиты = Новый Массив;
		
		Для Каждого ОтветственностьЗаРеквизит Из Объект.ОтветственностьЗаРеквизиты Цикл
			ДанныеЭтапа = Объект.Этапы.НайтиСтроки(Новый Структура("ИдентификаторЭтапа", ОтветственностьЗаРеквизит.ИдентификаторЭтапа));
			ПорядокОтветственности = ДанныеЭтапа[0].Порядок;
			Для Каждого Этап Из Объект.Этапы Цикл
				
				Если Этап.Порядок < ПорядокОтветственности
					ИЛИ ОтветственностьЗаРеквизит.ИдентификаторЭтапа = Этап.ИдентификаторЭтапа Тогда
					Продолжить;
				КонецЕсли;
				
				РеквизитНайден = Ложь;
				Для Каждого НедоступностьРеквизита Из Объект.НедоступныеРеквизиты Цикл
					Если НедоступностьРеквизита.ИдентификаторЭтапа = Этап.ИдентификаторЭтапа
						И НедоступностьРеквизита.ИмяТабличнойЧасти = ОтветственностьЗаРеквизит.ИмяТабличнойЧасти
						И НедоступностьРеквизита.ИмяРеквизита = ОтветственностьЗаРеквизит.ИмяРеквизита Тогда
						РеквизитНайден = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Если РеквизитНайден Тогда
					Продолжить;
				КонецЕсли;
				
				ПараметрыДоступногоРеквизита = Новый Структура;
				ПараметрыДоступногоРеквизита.Вставить("НомерЭтапа", Этап.НомерСтроки);
				ПараметрыДоступногоРеквизита.Вставить("ИдентификаторЭтапа", Этап.ИдентификаторЭтапа);
				ПараметрыДоступногоРеквизита.Вставить("Этап", Этап.Этап);
				ПараметрыДоступногоРеквизита.Вставить("ИмяТабличнойЧасти", ОтветственностьЗаРеквизит.ИмяТабличнойЧасти);
				ПараметрыДоступногоРеквизита.Вставить("ИмяРеквизита", ОтветственностьЗаРеквизит.ИмяРеквизита);
				
				ОшибочноДоступныеРеквизиты.Добавить(ПараметрыДоступногоРеквизита);
				
			КонецЦикла;
		КонецЦикла;
		
		Если ОшибочноДоступныеРеквизиты.Количество() > 0 ИЛИ Объект.УдалитьДоступностьРеквизитовЭтапов.Количество() > 0 Тогда
			
			Для Каждого ОшибочноДоступныйРеквизит Из ОшибочноДоступныеРеквизиты Цикл
				ЗаполнитьЗначенияСвойств(Объект.НедоступныеРеквизиты.Добавить(), ОшибочноДоступныйРеквизит)
			КонецЦикла;
			
			Объект.УдалитьДоступностьРеквизитовЭтапов.Очистить();
			
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Объект, Истина);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнениеРеквизитаКомментарийВЭтапах() Экспорт
	
	Выборка = Справочники.ЭтапыПроцессов.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Объект = Выборка.ПолучитьОбъект();
		
		Если НЕ ПустаяСтрока(Объект.Описание) Тогда
			
			Объект.Комментарий = Объект.Описание;
			Объект.Описание = "";
			
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Объект, Истина);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПорядокЭтаповШаблонов() Экспорт
	
	Выборка = Справочники.ШаблоныПроцессов.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Объект = Выборка.ПолучитьОбъект();
		
		Для Каждого Этап Из Объект.Этапы Цикл
			Этап.Порядок = 99;
			Если Лев(Этап.ПредшественникиВариантИспользования,6) = "Старт," Тогда
				Этап.Порядок = 0;
			КонецЕсли;
		КонецЦикла;
		
		ТекущийПорядок = 0;
		ПоследнееКоличествоСНеПрисвоеннымПорядком = 0;
		ТекущееКоличествоСНеПрисвоеннымПорядком = 99;
		Пока ТекущееКоличествоСНеПрисвоеннымПорядком <> ПоследнееКоличествоСНеПрисвоеннымПорядком Цикл
			ТекущееКоличествоСНеПрисвоеннымПорядком = ПоследнееКоличествоСНеПрисвоеннымПорядком;
			ПоследнееКоличествоСНеПрисвоеннымПорядком = 0;
			Для Каждого Этап Из Объект.Этапы Цикл
				Если Этап.Порядок <> 99 Тогда
					Продолжить;
				КонецЕсли;
				Предшественники = Объект.ПредшественникиЭтапов.НайтиСтроки(Новый Структура("ИдентификаторПоследователя", Этап.ИдентификаторЭтапа));
				МаксимальныйПорядокПредшественника = Неопределено;
				Для Каждого Предшественник Из Предшественники Цикл
					ДанныеПредшественника = Объект.Этапы.НайтиСтроки(Новый Структура("ИдентификаторЭтапа", Предшественник.ИдентификаторПредшественника));
					Если ДанныеПредшественника[0].Порядок = 99 Тогда
						Если Этап.ПредшественникиВариантИспользования = "ВсеПредшественники" Тогда
							// Если этап запускается по И и у одного из предшественников еще не заполнен порядок, то этапу на этой итерации порядок не присваивается
							МаксимальныйПорядокПредшественника = Неопределено;
							Прервать;
						Иначе
							Продолжить;
						КонецЕсли;
					КонецЕсли;
					Если Этап.ПредшественникиВариантИспользования = "ОдинИзПредшественников" Тогда
						// Если этап запускается по ИЛИ, то берем первого из заполненных предшественников
						МаксимальныйПорядокПредшественника = ДанныеПредшественника[0].Порядок;
						Прервать;
					КонецЕсли;
					// Если этап запускается по И - вычисляем максимальный порядок среди предшественников
					Если МаксимальныйПорядокПредшественника = Неопределено Тогда
						МаксимальныйПорядокПредшественника = ДанныеПредшественника[0].Порядок;
					Иначе
						МаксимальныйПорядокПредшественника = Макс(МаксимальныйПорядокПредшественника, ДанныеПредшественника[0].Порядок);
					КонецЕсли;
				КонецЦикла;
				Если МаксимальныйПорядокПредшественника <> Неопределено Тогда
					Этап.Порядок = МаксимальныйПорядокПредшественника + 1;
				КонецЕсли;
				Если Этап.Порядок = 99 Тогда
					ПоследнееКоличествоСНеПрисвоеннымПорядком = ПоследнееКоличествоСНеПрисвоеннымПорядком + 1;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Объект, Истина);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьТребованияКПроведению() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЭтапыПроцессовРезультатыВыполнения.Ссылка КАК Этап,
	|	ЭтапыПроцессовРезультатыВыполнения.СтатусПослеВыполнения КАК Статус
	|ИЗ
	|	Справочник.ЭтапыПроцессов.РезультатыВыполнения КАК ЭтапыПроцессовРезультатыВыполнения
	|ГДЕ
	|	НЕ ЭтапыПроцессовРезультатыВыполнения.ОтрицательныйРезультат";
	
	ПоложительныеРезультатыЭтапов = Запрос.Выполнить().Выгрузить();
	
	Выборка = Справочники.ШаблоныПроцессов.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Объект = Выборка.ПолучитьОбъект();
		
		Объект.ТребованияКПроведению.Очистить();
		
		Для Каждого Этап Из Объект.Этапы Цикл
			
			Если НЕ Этап.УдалитьТребуетсяПроведение Тогда
				Продолжить;
			КонецЕсли;
			
			Отбор = Новый Структура("Этап", Этап.Этап);
			ПоложительныеРезультаты = ПоложительныеРезультатыЭтапов.НайтиСтроки(Отбор);
			Для Каждого ПоложительныйРезультат Из ПоложительныеРезультаты Цикл
				НоваяСтрока = Объект.ТребованияКПроведению.Добавить();
				НоваяСтрока.ИдентификаторЭтапа = Этап.ИдентификаторЭтапа;
				НоваяСтрока.Статус = ПоложительныйРезультат.Статус;
				НоваяСтрока.ПризнакПроведенности = Истина;
			КонецЦикла;
			
		КонецЦикла;
		
		Если Объект.Модифицированность() Тогда
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Объект, Истина);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПереносПодписанныхДанныхИзЗадачиВРегистрСведений() Экспорт
	
	НаборЗаписей = РегистрыСведений.ПодписанныеДанные.СоздатьНаборЗаписей();
	
	НаборЗаписей.Прочитать();
	// Если записи в регистре уже есть, значит перенос уже был выполнен, повторный перенос не требуется
	Если НаборЗаписей.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗадачаПоОбработкеДокумента.Ссылка КАК Задача,
	|	ЗадачаПоОбработкеДокумента.УдалитьСоставПодписи КАК СоставПодписи,
	|	ЗадачаПоОбработкеДокумента.УдалитьПодписанныеДанные КАК ПодписанныеДанные
	|ИЗ
	|	Задача.ЗадачаПоОбработкеДокумента КАК ЗадачаПоОбработкеДокумента
	|ГДЕ
	|	ЗадачаПоОбработкеДокумента.ПодписанЭП";
	
	НаборЗаписей.Загрузить(Запрос.Выполнить().Выгрузить());
	
	ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей, Ложь);
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитЗапретитьПерепроведение() Экспорт
	
	ВыборкаШаблоны = Справочники.ШаблоныПроцессов.Выбрать();
	
	Пока ВыборкаШаблоны.Следующий() Цикл
		
		ОбъектШаблон = ВыборкаШаблоны.ПолучитьОбъект();
		
		Для Каждого Этап Из ОбъектШаблон.Этапы Цикл
			Если Этап.ЗапретитьПроведениеОтменуПроведения Тогда
				Этап.ЗапретитьПерепроведение = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если ОбъектШаблон.Модифицированность() Тогда
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ОбъектШаблон);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьГруппуИсполнителейЗадачНазначающих() Экспорт
	
	НаборЗаписей = РегистрыСведений.НастройкаПравНазначенияИсполнителей.СоздатьНаборЗаписей();
	
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		
		Если ТипЗнч(Запись.НазначающийИсполнителей) = Тип("СправочникСсылка.РолиИсполнителей")
			И НЕ ЗначениеЗаполнено(Запись.ГруппаИсполнителейЗадачНазначающий) Тогда
			Запись.ГруппаИсполнителейЗадачНазначающий = БизнесПроцессыИЗадачиСервер.ГруппаИсполнителейЗадач(Запись.НазначающийИсполнителей,
				Запись.ОсновнойОбъектАдресацииНазначающего, Запись.ДополнительныйОбъектАдресацииНазначающего);
		КонецЕсли;
		
	КонецЦикла;
	
	Если НаборЗаписей.Модифицированность() Тогда
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПереносИсторииСтатусовДокументов() Экспорт
	
	НаборЗаписей = РегистрыСведений.ИсторияИзмененияСтатусовДокументов.СоздатьНаборЗаписей();
	
	НаборЗаписей.Прочитать();
	// Если записи в регистре уже есть, значит перенос уже был выполнен, повторный перенос не требуется
	Если НаборЗаписей.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МАКСИМУМ(УдалитьИсторияСтатусовДокументов.Период) КАК Период,
	|	УдалитьИсторияСтатусовДокументов.Предмет КАК Предмет,
	|	УдалитьИсторияСтатусовДокументов.Установил КАК Установил
	|ПОМЕСТИТЬ ВТ_ПоследниеЗаписи
	|ИЗ
	|	РегистрСведений.УдалитьИсторияСтатусовДокументов КАК УдалитьИсторияСтатусовДокументов
	|
	|СГРУППИРОВАТЬ ПО
	|	УдалитьИсторияСтатусовДокументов.Предмет,
	|	УдалитьИсторияСтатусовДокументов.Установил
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПоследниеЗаписи.Период КАК ДатаУстановки,
	|	ВТ_ПоследниеЗаписи.Предмет КАК Предмет,
	|	ВТ_ПоследниеЗаписи.Установил КАК Установил,
	|	УдалитьИсторияСтатусовДокументов.Статус КАК Статус
	|ИЗ
	|	ВТ_ПоследниеЗаписи КАК ВТ_ПоследниеЗаписи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УдалитьИсторияСтатусовДокументов КАК УдалитьИсторияСтатусовДокументов
	|		ПО ВТ_ПоследниеЗаписи.Период = УдалитьИсторияСтатусовДокументов.Период
	|			И ВТ_ПоследниеЗаписи.Предмет = УдалитьИсторияСтатусовДокументов.Предмет
	|			И ВТ_ПоследниеЗаписи.Установил = УдалитьИсторияСтатусовДокументов.Установил";
	
	НаборЗаписей.Загрузить(Запрос.Выполнить().Выгрузить());
	
	ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей, Ложь);
	
КонецПроцедуры

Процедура КорректировкаРегистраТекущиеСтатусыДокументов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТекущиеСтатусыДокументов.Предмет КАК Предмет,
	|	ТекущиеСтатусыДокументов.Шаблон КАК Шаблон,
	|	ТекущиеСтатусыДокументов.Установил КАК Установил
	|ПОМЕСТИТЬ ТекущиеСтатусыСНевыполненнымиЗадачами
	|ИЗ
	|	РегистрСведений.ТекущиеСтатусыДокументов КАК ТекущиеСтатусыДокументов
	|ГДЕ
	|	ТекущиеСтатусыДокументов.Установил ССЫЛКА Задача.ЗадачаПоОбработкеДокумента
	|	И НЕ ВЫРАЗИТЬ(ТекущиеСтатусыДокументов.Установил КАК Задача.ЗадачаПоОбработкеДокумента).Выполнена
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТекущиеСтатусыСНевыполненнымиЗадачами.Предмет КАК Предмет,
	|	ТекущиеСтатусыСНевыполненнымиЗадачами.Шаблон КАК Шаблон,
	|	МАКСИМУМ(ИсторияИзмененияСтатусовДокументов.ДатаУстановки) КАК ДатаУстановки
	|ПОМЕСТИТЬ ПоследниеИзмененияСтатусов
	|ИЗ
	|	РегистрСведений.ИсторияИзмененияСтатусовДокументов КАК ИсторияИзмененияСтатусовДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТекущиеСтатусыСНевыполненнымиЗадачами КАК ТекущиеСтатусыСНевыполненнымиЗадачами
	|		ПО ИсторияИзмененияСтатусовДокументов.Предмет = ТекущиеСтатусыСНевыполненнымиЗадачами.Предмет
	|			И ИсторияИзмененияСтатусовДокументов.Установил <> ТекущиеСтатусыСНевыполненнымиЗадачами.Установил
	|
	|СГРУППИРОВАТЬ ПО
	|	ТекущиеСтатусыСНевыполненнымиЗадачами.Предмет,
	|	ТекущиеСтатусыСНевыполненнымиЗадачами.Шаблон
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсторияИзмененияСтатусовДокументов.Предмет КАК Предмет,
	|	ИсторияИзмененияСтатусовДокументов.Установил КАК Установил,
	|	ИсторияИзмененияСтатусовДокументов.Статус КАК Статус,
	|	ИсторияИзмененияСтатусовДокументов.ДатаУстановки КАК ДатаУстановки,
	|	ПоследниеИзмененияСтатусов.Шаблон КАК Шаблон
	|ИЗ
	|	РегистрСведений.ИсторияИзмененияСтатусовДокументов КАК ИсторияИзмененияСтатусовДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПоследниеИзмененияСтатусов КАК ПоследниеИзмененияСтатусов
	|		ПО ИсторияИзмененияСтатусовДокументов.Предмет = ПоследниеИзмененияСтатусов.Предмет
	|			И ИсторияИзмененияСтатусовДокументов.ДатаУстановки = ПоследниеИзмененияСтатусов.ДатаУстановки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.ТекущиеСтатусыДокументов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Предмет.Установить(Выборка.Предмет);
		ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПереносДатыУстановкиВИзмерениеРегистраИсторииСтатусов() Экспорт
	
	НаборЗаписей = РегистрыСведений.ИсторияИзмененияСтатусовДокументов.СоздатьНаборЗаписей();
	
	НаборЗаписей.Прочитать();
	// Если записи в регистре уже есть, и дата уже заполнена, значит перенос уже был выполнен, повторный перенос не требуется
	Если НаборЗаписей.Количество() > 0 И ЗначениеЗаполнено(НаборЗаписей[0].ДатаУстановки) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИсторияИзмененияСтатусовДокументов.Предмет КАК Предмет,
	|	ИсторияИзмененияСтатусовДокументов.Установил КАК Установил,
	|	ИсторияИзмененияСтатусовДокументов.УстарелДатаУстановки КАК ДатаУстановки,
	|	ИсторияИзмененияСтатусовДокументов.Статус КАК Статус,
	|	ИсторияИзмененияСтатусовДокументов.УстарелДатаУстановки КАК УстарелДатаУстановки
	|ИЗ
	|	РегистрСведений.ИсторияИзмененияСтатусовДокументов КАК ИсторияИзмененияСтатусовДокументов";
	
	НаборЗаписей.Загрузить(Запрос.Выполнить().Выгрузить());
	
	ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
	
КонецПроцедуры

Процедура ЗаполнитьТипПредметаВНевыполненныхЗадачах() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗадачаПоОбработкеДокумента.Ссылка КАК Ссылка,
	|	ЗадачаПоОбработкеДокумента.Предмет КАК Предмет
	|ИЗ
	|	Задача.ЗадачаПоОбработкеДокумента КАК ЗадачаПоОбработкеДокумента
	|ГДЕ
	|	НЕ ЗадачаПоОбработкеДокумента.Выполнена
	|	И ЗадачаПоОбработкеДокумента.Предмет <> НЕОПРЕДЕЛЕНО
	|	И ЗадачаПоОбработкеДокумента.ТипПредметаСтрокой = """"";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		
		Объект.ТипПредметаСтрокой = Выборка.Предмет.Метаданные().Синоним;
		
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Объект, Истина);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьКонстантуОтображенияДатыПодписанияВШтампеПЭП() Экспорт
	
	Если Константы.ОтображатьДатуПодписанияВШтампеВизуализацииПЭППОД.Получить() = Ложь Тогда
		
		Константы.ОтображатьДатуПодписанияВШтампеВизуализацииПЭППОД.Установить(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗарегистрироватьДанныеКОбработкеРегистрНаличиеФайлов(Параметры) Экспорт

	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметры.ПолноеИмяРегистра = "РегистрСведений.НаличиеФайлов";
	ДополнительныеПараметры.ЭтоНезависимыйРегистрСведений = Истина;
			
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НаличиеФайлов.ОбъектСФайлами КАК ОбъектСФайлами
	|ИЗ
	|	РегистрСведений.НаличиеФайлов КАК НаличиеФайлов
	|ГДЕ
	|	НаличиеФайлов.ЕстьФайлы";
	
	Данные = Запрос.Выполнить().Выгрузить();
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Данные, ДополнительныеПараметры);
	
КонецПроцедуры    

Процедура ОбработатьДанныеРегистрНаличиеФайлов(Параметры) Экспорт
	
	Параметры.ОбработкаЗавершена = Ложь;
	
	ПолноеИмяРегистра = "РегистрСведений.НаличиеФайлов";
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыВыборкиДанныхДляОбработки();
	
	РезультатВыборки = ОбновлениеИнформационнойБазы.СоздатьВременнуюТаблицуИзмеренийНезависимогоРегистраСведенийДляОбработки(
	Параметры.Очередь,
	ПолноеИмяРегистра,
	МенеджерВременныхТаблиц,		
	ДополнительныеПараметры);
	
	Если НЕ РезультатВыборки.ЕстьДанныеДляОбработки Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	ИначеЕсли НЕ РезультатВыборки.ЕстьЗаписиВоВременнойТаблице Тогда
		Возврат;
	КонецЕсли;
	
	ИмяВременнойТаблицы = РезультатВыборки.ИмяВременнойТаблицы;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НаличиеФайлов.ОбъектСФайлами КАК ОбъектСФайлами,
	|	ПРЕДСТАВЛЕНИЕ(НаличиеФайлов.ОбъектСФайлами) КАК ОбъектСФайламиПредставление
	|ИЗ
	|	РегистрСведений.НаличиеФайлов КАК НаличиеФайлов
	|ГДЕ
	|	НаличиеФайлов.ОбъектСФайлами В
	|			(ВЫБРАТЬ
	|				ВременннаяТаблица.ОбъектСФайлами
	|			ИЗ
	|				&ВременннаяТаблица КАК ВременннаяТаблица)";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ВременннаяТаблица", ИмяВременнойТаблицы); 
	
	РезультатЗапроса = Запрос.Выполнить(); 
	Выборка = РезультатЗапроса.Выбрать();  
	
	ТабОбработано = Новый ТаблицаЗначений;
	ТабОбработано.Колонки.Добавить("ОбъектСФайлами");
	
	Пока Выборка.Следующий() Цикл
		
		ФайлыДокументаУчета = Новый Массив;
		РаботаСФайлами.ЗаполнитьПрисоединенныеФайлыКОбъекту(Выборка.ОбъектСФайлами, ФайлыДокументаУчета);
		ЕстьФайлы = Ложь;
		Для Каждого ТекФайл Из ФайлыДокументаУчета Цикл  
			Если НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекФайл, "Служебный") Тогда
				ЕстьФайлы = Истина;
				Прервать;
			ИначеЕсли ТекФайл.Служебный = Ложь Тогда
				ЕстьФайлы = Истина;
				Прервать;
			КонецЕсли;    
		КонецЦикла; 
		
		НачатьТранзакцию();
		Попытка
			Если НЕ ЕстьФайлы Тогда
				//Исправление ошибки 
				Блокировка = Новый БлокировкаДанных;
				ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяРегистра);
				ЭлементБлокировки.УстановитьЗначение("ОбъектСФайлами", Выборка.ОбъектСФайлами); 
				Блокировка.Заблокировать();  
				Набор = РегистрыСведений.НаличиеФайлов.СоздатьНаборЗаписей();
				Набор.Отбор.ОбъектСФайлами.Установить(Выборка.ОбъектСФайлами);
				Набор.Прочитать();
				Для Каждого Запись Из Набор Цикл
					Запись.ЕстьФайлы = Ложь;
				КонецЦикла;	
				ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(Набор, Истина, Ложь, Ложь);		
				ЗафиксироватьТранзакцию(); 
				Стр =ТабОбработано.Добавить();
				Стр.ОбъектСФайлами = Выборка.ОбъектСФайлами;
			Иначе 
				Стр =ТабОбработано.Добавить();
				Стр.ОбъектСФайлами = Выборка.ОбъектСФайлами;
				ЗафиксироватьТранзакцию();
			КонецЕсли; 
		Исключение
			ОтменитьТранзакцию();
			ТекстСообщения = НСтр("ru = 'Не удалось обработать объект: %Объект% по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Объект%", Выборка.ОбъектСФайламиПредставление);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.РегистрыСведений.НаличиеФайлов,
			Выборка.ОбъектСФайлами,
			ТекстСообщения);
		КонецПопытки;  
		
	КонецЦикла; 
	
	Если ТабОбработано.Количество() > 0 Тогда
		ДопПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
		ДопПараметры.ЭтоНезависимыйРегистрСведений = Истина;
		ДопПараметры.ПолноеИмяРегистра = "РегистрСведений.НаличиеФайлов"; 
		ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(ТабОбработано, ДопПараметры, Параметры.Очередь);
	КонецЕсли;
	
	Если РезультатЗапроса.Пустой() Тогда
		//если из регистра были удалены записи, то чтобы не было зацикливания, отметим, что обработка выполнена
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВременннаяТаблица.ОбъектСФайлами КАК ОбъектСФайлами
		|ИЗ
		|	&ВременннаяТаблица КАК ВременннаяТаблица";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ВременннаяТаблица", ИмяВременнойТаблицы);
		ТаблицаДанных = Запрос.Выполнить().Выгрузить();
		ДопПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
		ДопПараметры.ЭтоНезависимыйРегистрСведений = Истина;
		ДопПараметры.ПолноеИмяРегистра = "РегистрСведений.НаличиеФайлов";
		ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(ТаблицаДанных, ДопПараметры, Параметры.Очередь);
	КонецЕсли;
	
	Параметры.ОбработкаЗавершена = НЕ ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяРегистра);	
	
КонецПроцедуры

Процедура ОбновитьТипыДополнительныхКолонок() Экспорт
	
	ПроцессыОбработкиДокументов.ОбновитьТипыДополнительныхКолонок();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбновленияПриПоявленииСоставногоТипаВОбъектахАдресацииЗадач

Процедура ОбновитьИсполнителейЗадач() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИсполнителиЗадач.РольИсполнителя КАК РольИсполнителя,
	|	ИсполнителиЗадач.Исполнитель КАК Исполнитель,
	|	ИсполнителиЗадач.ОсновнойОбъектАдресации КАК ОсновнойОбъектАдресации,
	|	ИсполнителиЗадач.ДополнительныйОбъектАдресации КАК ДополнительныйОбъектАдресации
	|ИЗ
	|	РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадач";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НачатьТранзакцию();
	
	Попытка
		
		НаборЗаписей = РегистрыСведений.ИсполнителиЗадач.СоздатьНаборЗаписей();
		
		Пока Выборка.Следующий() Цикл
			
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.РольИсполнителя = Выборка.РольИсполнителя;
			НоваяЗапись.Исполнитель = Выборка.Исполнитель;
			Если Не ЗначениеЗаполнено(Выборка.ОсновнойОбъектАдресации) И Выборка.ОсновнойОбъектАдресации <> Неопределено Тогда
				НоваяЗапись.ОсновнойОбъектАдресации = Неопределено;
			Иначе
				НоваяЗапись.ОсновнойОбъектАдресации = Выборка.ОсновнойОбъектАдресации;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(Выборка.ДополнительныйОбъектАдресации) И Выборка.ДополнительныйОбъектАдресации <> Неопределено Тогда
				НоваяЗапись.ДополнительныйОбъектАдресации = Неопределено;
			Иначе
				НоваяЗапись.ДополнительныйОбъектАдресации = Выборка.ДополнительныйОбъектАдресации;
			КонецЕсли;
			
		КонецЦикла;
		
		НовыеИсполнителиЗадач = НаборЗаписей.Выгрузить();
		НовыеИсполнителиЗадач.Свернуть("РольИсполнителя,Исполнитель,ОсновнойОбъектАдресации,ДополнительныйОбъектАдресации");
		
		ГруппыИсполнителейЗадач = БизнесПроцессыИЗадачиСервер.ГруппыИсполнителейЗадач(НовыеИсполнителиЗадач);
		
		НаборЗаписей.Загрузить(НовыеИсполнителиЗадач);
		
		Индекс = 0;
		Для Каждого Запись Из НаборЗаписей Цикл
			Запись.ГруппаИсполнителейЗадач = ГруппыИсполнителейЗадач[Индекс];
			Индекс = Индекс + 1;
		КонецЦикла;
		
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Обновление исполнителей задач'"),
			УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура ОбновитьШаблоныПроцессов() Экспорт
	
	ТипРоль = Тип("СправочникСсылка.РолиИсполнителей");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ШаблоныПроцессовЭтапы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ШаблоныПроцессов.Этапы КАК ШаблоныПроцессовЭтапы
	|ГДЕ
	|	ШаблоныПроцессовЭтапы.Исполнитель ССЫЛКА Справочник.РолиИсполнителей
	|	И (ШаблоныПроцессовЭтапы.ОсновнойОбъектАдресации <> НЕОПРЕДЕЛЕНО
	|			ИЛИ ШаблоныПроцессовЭтапы.ДополнительныйОбъектАдресации <> НЕОПРЕДЕЛЕНО)
	|
	|СГРУППИРОВАТЬ ПО
	|	ШаблоныПроцессовЭтапы.Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НачатьТранзакцию();
	
	Попытка
		
		Пока Выборка.Следующий() Цикл
			ШаблонОбъект = Выборка.Ссылка.ПолучитьОбъект();
			Для Каждого Этап Из ШаблонОбъект.Этапы Цикл
				Если ТипЗнч(Этап.Исполнитель) <> ТипРоль Тогда
					Продолжить;
				КонецЕсли;
				Если Не ЗначениеЗаполнено(Этап.ОсновнойОбъектАдресации) И Этап.ОсновнойОбъектАдресации <> Неопределено Тогда
					Этап.ОсновнойОбъектАдресации = Неопределено;
				КонецЕсли;
				Если Не ЗначениеЗаполнено(Этап.ДополнительныйОбъектАдресации) И Этап.ДополнительныйОбъектАдресации <> Неопределено Тогда
					Этап.ДополнительныйОбъектАдресации = Неопределено;
				КонецЕсли;
			КонецЦикла;
			Если ШаблонОбъект.Модифицированность() Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ШаблонОбъект);
			КонецЕсли;
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Обновление шаблонов процессов'"),
			УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура ОбновитьРегламентныеИнтервалы() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РегламентныеИнтервалы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.РегламентныеИнтервалы КАК РегламентныеИнтервалы
	|ГДЕ
	|	РегламентныеИнтервалы.Куратор ССЫЛКА Справочник.РолиИсполнителей
	|	И (РегламентныеИнтервалы.ОсновнойОбъектАдресацииКуратора <> НЕОПРЕДЕЛЕНО
	|			ИЛИ РегламентныеИнтервалы.ДополнительныйОбъектАдресацииКуратора <> НЕОПРЕДЕЛЕНО)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НачатьТранзакцию();
	
	Попытка
		
		Пока Выборка.Следующий() Цикл
			РИОбъект = Выборка.Ссылка.ПолучитьОбъект();
			Если Не ЗначениеЗаполнено(РИОбъект.ОсновнойОбъектАдресацииКуратора) И РИОбъект.ОсновнойОбъектАдресацииКуратора <> Неопределено Тогда
				РИОбъект.ОсновнойОбъектАдресацииКуратора = Неопределено;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(РИОбъект.ДополнительныйОбъектАдресацииКуратора) И РИОбъект.ДополнительныйОбъектАдресацииКуратора <> Неопределено Тогда
				РИОбъект.ДополнительныйОбъектАдресацииКуратора = Неопределено;
			КонецЕсли;
			Если РИОбъект.Модифицированность() Тогда
				РИОбъект.ГруппаИсполнителейЗадачКуратора = БизнесПроцессыИЗадачиСервер.ГруппаИсполнителейЗадач(
					РИОбъект.Куратор, РИОбъект.ОсновнойОбъектАдресацииКуратора, РИОбъект.ДополнительныйОбъектАдресацииКуратора);
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(РИОбъект);
			КонецЕсли;
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Обновление регламентных интервалов'"),
			УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура ОбновитьНастройкиПравНазначенияИсполнителей() Экспорт
	
	ТипРоль = Тип("СправочникСсылка.РолиИсполнителей");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкаПравНазначенияИсполнителей.НазначающийИсполнителей КАК НазначающийИсполнителей,
	|	НастройкаПравНазначенияИсполнителей.РольИсполнителя КАК РольИсполнителя,
	|	НастройкаПравНазначенияИсполнителей.ОсновнойОбъектАдресацииИсполнителя КАК ОсновнойОбъектАдресацииИсполнителя,
	|	НастройкаПравНазначенияИсполнителей.ОсновнойОбъектАдресацииНазначающего КАК ОсновнойОбъектАдресацииНазначающего,
	|	НастройкаПравНазначенияИсполнителей.ДополнительныйОбъектАдресацииИсполнителя КАК ДополнительныйОбъектАдресацииИсполнителя,
	|	НастройкаПравНазначенияИсполнителей.ДополнительныйОбъектАдресацииНазначающего КАК ДополнительныйОбъектАдресацииНазначающего,
	|	НастройкаПравНазначенияИсполнителей.ГруппаИсполнителейЗадачНазначающий КАК ГруппаИсполнителейЗадачНазначающий
	|ИЗ
	|	РегистрСведений.НастройкаПравНазначенияИсполнителей КАК НастройкаПравНазначенияИсполнителей
	|
	|УПОРЯДОЧИТЬ ПО
	|	НазначающийИсполнителей,
	|	РольИсполнителя";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НачатьТранзакцию();
	
	Попытка
		
		НаборЗаписей = РегистрыСведений.НастройкаПравНазначенияИсполнителей.СоздатьНаборЗаписей();
		
		Пока Выборка.СледующийПоЗначениюПоля("НазначающийИсполнителей") Цикл
			
			Пока Выборка.СледующийПоЗначениюПоля("РольИсполнителя") Цикл
				
				НаборЗаписей.Очистить();
				Пока Выборка.Следующий() Цикл
					
					НоваяЗапись = НаборЗаписей.Добавить();
					
					НоваяЗапись.НазначающийИсполнителей = Выборка.НазначающийИсполнителей;
					НоваяЗапись.РольИсполнителя = Выборка.РольИсполнителя;
					Если Не ЗначениеЗаполнено(Выборка.ОсновнойОбъектАдресацииИсполнителя) И Выборка.ОсновнойОбъектАдресацииИсполнителя <> Неопределено Тогда
						НоваяЗапись.ОсновнойОбъектАдресацииИсполнителя = Неопределено;
					Иначе
						НоваяЗапись.ОсновнойОбъектАдресацииИсполнителя = Выборка.ОсновнойОбъектАдресацииИсполнителя;
					КонецЕсли;
					Если Не ЗначениеЗаполнено(Выборка.ДополнительныйОбъектАдресацииИсполнителя) И Выборка.ДополнительныйОбъектАдресацииИсполнителя <> Неопределено Тогда
						НоваяЗапись.ДополнительныйОбъектАдресацииИсполнителя = Неопределено;
					Иначе
						НоваяЗапись.ДополнительныйОбъектАдресацииИсполнителя = Выборка.ДополнительныйОбъектАдресацииИсполнителя;
					КонецЕсли;
					Если Не ЗначениеЗаполнено(Выборка.ОсновнойОбъектАдресацииИсполнителя) И Выборка.ОсновнойОбъектАдресацииИсполнителя <> Неопределено Тогда
						НоваяЗапись.ОсновнойОбъектАдресацииИсполнителя = Неопределено;
					Иначе
						НоваяЗапись.ОсновнойОбъектАдресацииИсполнителя = Выборка.ОсновнойОбъектАдресацииИсполнителя;
					КонецЕсли;
					Если Не ЗначениеЗаполнено(Выборка.ДополнительныйОбъектАдресацииИсполнителя) И Выборка.ДополнительныйОбъектАдресацииИсполнителя <> Неопределено Тогда
						НоваяЗапись.ДополнительныйОбъектАдресацииИсполнителя = Неопределено;
					Иначе
						НоваяЗапись.ДополнительныйОбъектАдресацииИсполнителя = Выборка.ДополнительныйОбъектАдресацииИсполнителя;
					КонецЕсли;
					
					Если ТипРоль = ТипЗнч(НоваяЗапись.НазначающийИсполнителей) Тогда
						НоваяЗапись.ГруппаИсполнителейЗадачНазначающий = БизнесПроцессыИЗадачиСервер.ГруппаИсполнителейЗадач(
							НоваяЗапись.НазначающийИсполнителей,
							НоваяЗапись.ОсновнойОбъектАдресацииНазначающего,
							НоваяЗапись.ДополнительныйОбъектАдресацииНазначающего);
					КонецЕсли;
					
				КонецЦикла;
				
				НаборЗаписей.Отбор.НазначающийИсполнителей.Установить(Выборка.НазначающийИсполнителей);
				НаборЗаписей.Отбор.РольИсполнителя.Установить(Выборка.РольИсполнителя);
				
				ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
				
			КонецЦикла;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Обновление настроек прав назначения исполнителей'"),
			УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура ОбновитьНастройкиПередачиПравИсполнителей() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкаПередачиПравИсполнителей.Кому КАК Кому,
	|	НастройкаПередачиПравИсполнителей.ОтКого КАК ОтКого,
	|	НастройкаПередачиПравИсполнителей.РольИсполнителей КАК РольИсполнителей,
	|	НастройкаПередачиПравИсполнителей.ОсновнойОбъектАдресации КАК ОсновнойОбъектАдресации,
	|	НастройкаПередачиПравИсполнителей.ДополнительныйОбъектАдресации КАК ДополнительныйОбъектАдресации,
	|	НастройкаПередачиПравИсполнителей.ДатаНачалаДействия КАК ДатаНачалаДействия,
	|	НастройкаПередачиПравИсполнителей.ДатаОкончанияДействия КАК ДатаОкончанияДействия
	|ИЗ
	|	РегистрСведений.НастройкаПередачиПравИсполнителей КАК НастройкаПередачиПравИсполнителей
	|
	|УПОРЯДОЧИТЬ ПО
	|	РольИсполнителей";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НачатьТранзакцию();
	
	Попытка
		
		НаборЗаписей = РегистрыСведений.НастройкаПередачиПравИсполнителей.СоздатьНаборЗаписей();
		
		Пока Выборка.СледующийПоЗначениюПоля("РольИсполнителей") Цикл
			
			НаборЗаписей.Очистить();
			Пока Выборка.Следующий() Цикл
				
				НоваяЗапись = НаборЗаписей.Добавить();
				
				НоваяЗапись.Кому = Выборка.Кому;
				НоваяЗапись.ОтКого = Выборка.ОтКого;
				НоваяЗапись.РольИсполнителей = Выборка.РольИсполнителей;
				
				Если Не ЗначениеЗаполнено(Выборка.ОсновнойОбъектАдресации) И Выборка.ОсновнойОбъектАдресации <> Неопределено Тогда
					НоваяЗапись.ОсновнойОбъектАдресации = Неопределено;
				Иначе
					НоваяЗапись.ОсновнойОбъектАдресации = Выборка.ОсновнойОбъектАдресации;
				КонецЕсли;
				Если Не ЗначениеЗаполнено(Выборка.ОсновнойОбъектАдресации) И Выборка.ОсновнойОбъектАдресации <> Неопределено Тогда
					НоваяЗапись.ОсновнойОбъектАдресации = Неопределено;
				Иначе
					НоваяЗапись.ОсновнойОбъектАдресации = Выборка.ОсновнойОбъектАдресации;
				КонецЕсли;
				
				НоваяЗапись.ДатаНачалаДействия = Выборка.ДатаНачалаДействия;
				НоваяЗапись.ДатаОкончанияДействия = Выборка.ДатаОкончанияДействия;
				
			КонецЦикла;
			
			НаборЗаписей.Отбор.РольИсполнителей.Установить(Выборка.РольИсполнителей);
			
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Обновление настроек передачи прав исполнителей'"),
			УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура ОбновитьАктивныеЗадачиПоОбработкеДокументов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗадачаПоОбработкеДокумента.Ссылка КАК Ссылка
	|ИЗ
	|	Задача.ЗадачаПоОбработкеДокумента КАК ЗадачаПоОбработкеДокумента
	|ГДЕ
	|	НЕ ЗадачаПоОбработкеДокумента.Выполнена
	|	И ЗадачаПоОбработкеДокумента.РольИсполнителя <> ЗНАЧЕНИЕ(Справочник.РолиИсполнителей.ПустаяСсылка)
	|	И (ЗадачаПоОбработкеДокумента.ОсновнойОбъектАдресации <> НЕОПРЕДЕЛЕНО
	|			ИЛИ ЗадачаПоОбработкеДокумента.ДополнительныйОбъектАдресации <> НЕОПРЕДЕЛЕНО)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НачатьТранзакцию();
	
	Попытка
		
		Пока Выборка.Следующий() Цикл
			
			ЗадачаОбъект = Выборка.Ссылка.ПолучитьОбъект();
			Если Не ЗначениеЗаполнено(ЗадачаОбъект.ОсновнойОбъектАдресации) И ЗадачаОбъект.ОсновнойОбъектАдресации <> Неопределено Тогда
				ЗадачаОбъект.ОсновнойОбъектАдресации = Неопределено;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(ЗадачаОбъект.ДополнительныйОбъектАдресации) И ЗадачаОбъект.ДополнительныйОбъектАдресации <> Неопределено Тогда
				ЗадачаОбъект.ДополнительныйОбъектАдресации = Неопределено;
			КонецЕсли;
			Если ЗадачаОбъект.Модифицированность() Тогда
				ЗадачаОбъект.ГруппаИсполнителейЗадач = БизнесПроцессыИЗадачиСервер.ГруппаИсполнителейЗадач(
					ЗадачаОбъект.РольИсполнителя, ЗадачаОбъект.ОсновнойОбъектАдресации, ЗадачаОбъект.ДополнительныйОбъектАдресации);
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ЗадачаОбъект);
			КонецЕсли;
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Обновление активных задач по обработке документов'"),
			УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗарегистрироватьВыполненныеЗадачиДанныеКОбработке(Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗадачаПоОбработкеДокумента.Ссылка КАК Ссылка
	|ИЗ
	|	Задача.ЗадачаПоОбработкеДокумента КАК ЗадачаПоОбработкеДокумента
	|ГДЕ
	|	ЗадачаПоОбработкеДокумента.Выполнена
	|	И ЗадачаПоОбработкеДокумента.РольИсполнителя <> ЗНАЧЕНИЕ(Справочник.РолиИсполнителей.ПустаяСсылка)
	|	И (ЗадачаПоОбработкеДокумента.ОсновнойОбъектАдресации <> НЕОПРЕДЕЛЕНО
	|			ИЛИ ЗадачаПоОбработкеДокумента.ДополнительныйОбъектАдресации <> НЕОПРЕДЕЛЕНО)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗадачаПоОбработкеДокумента.Дата УБЫВ";
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
КонецПроцедуры

Процедура ОбновитьВыполненныеЗадачиПоОбработкеДокументов(Параметры) Экспорт
	
	Параметры.ОбработкаЗавершена = Ложь;
	ПолноеИмяОбъекта = "Задача.ЗадачаПоОбработкеДокумента";
	Выборка = ОбновлениеИнформационнойБазы.ВыбратьСсылкиДляОбработки(Параметры.Очередь, ПолноеИмяОбъекта);
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			Элемент = Блокировка.Добавить(ПолноеИмяОбъекта);
			Элемент.УстановитьЗначение("Ссылка", Выборка.Ссылка);
			Элемент.Режим = РежимБлокировкиДанных.Исключительный;
			
			Блокировка.Заблокировать();
			
			Объект = Выборка.Ссылка.ПолучитьОбъект();
			
			Если Объект = Неопределено Тогда
				
				// Вероятно был удален раньше, чем обработчик дошел до него
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
				
			Иначе
				
				Если Не ЗначениеЗаполнено(Объект.ОсновнойОбъектАдресации) И Объект.ОсновнойОбъектАдресации <> Неопределено Тогда
					Объект.ОсновнойОбъектАдресации = Неопределено;
				КонецЕсли;
				Если Не ЗначениеЗаполнено(Объект.ДополнительныйОбъектАдресации) И Объект.ДополнительныйОбъектАдресации <> Неопределено Тогда
					Объект.ДополнительныйОбъектАдресации = Неопределено;
				КонецЕсли;
				
				Если Не Объект.Модифицированность() Тогда
					
					ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
					
				Иначе
					
					Объект.ГруппаИсполнителейЗадач = БизнесПроцессыИЗадачиСервер.ГруппаИсполнителейЗадач(
						Объект.РольИсполнителя, Объект.ОсновнойОбъектАдресации, Объект.ДополнительныйОбъектАдресации);
					
					ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Объект);
					
				КонецЕсли;
				
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ТекстСообщения = НСтр("ru = 'Не удалось записать задачу: %Объект% по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Объект%", Выборка.Ссылка);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Предупреждение,
				Метаданные.Задачи.ЗадачаПоОбработкеДокумента,
				Выборка.Ссылка,
				ТекстСообщения);
			ВызватьИсключение;
			
		КонецПопытки;
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

 // См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("ОбновитьТипыДополнительныхКолонок", Истина); 
	Методы.Вставить("ОбработатьДанныеРегистрНаличиеФайлов", Истина); 
	Методы.Вставить("ЗаполнитьТипПредметаВНевыполненныхЗадачах", Истина);
    Методы.Вставить("ЗаполнитьТребованияКПроведению", Истина);
    Методы.Вставить("УстановитьКонстантуОтображенияДатыПодписанияВШтампеПЭП", Истина);
	Методы.Вставить("КорректировкаРегистраТекущиеСтатусыДокументов", Истина); 
	Методы.Вставить("ЗаполнитьГруппуИсполнителейЗадачНазначающих", Истина);
	Методы.Вставить("ЗарегистрироватьДанныеКОбработкеРегистрНаличиеФайлов", Истина); 
	Методы.Вставить("ЗаполнитьПорядокЭтаповШаблонов", Истина);
	Методы.Вставить("ПереносДатыУстановкиВИзмерениеРегистраИсторииСтатусов", Истина);
    Методы.Вставить("ЗаполнениеРеквизитаКомментарийВЭтапах", Истина); 
	Методы.Вставить("КорректировкаДоступностиШаблонов", Истина);  
	Методы.Вставить("ПереносПодписанныхДанныхИзЗадачиВРегистрСведений", Истина); 
	Методы.Вставить("ЗаполнитьРеквизитЗапретитьПерепроведение", Истина);
	Методы.Вставить("ПереносИсторииСтатусовДокументов", Истина);  
	
КонецПроцедуры
